test-load-results/k6-golang-io-results.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: /load.js
     output: -

  scenarios: (100.00%) 1 scenario, 60 max VUs, 2m30s max duration (incl. graceful stop):
           * default: Up to 60 looping VUs for 2m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/60 VUs, 6 complete and 0 interrupted iterations
default   [   1% ] 01/60 VUs  0m01.0s/2m00.0s

running (0m02.0s), 02/60 VUs, 14 complete and 0 interrupted iterations
default   [   2% ] 02/60 VUs  0m02.0s/2m00.0s

running (0m03.0s), 02/60 VUs, 28 complete and 0 interrupted iterations
default   [   2% ] 02/60 VUs  0m03.0s/2m00.0s

running (0m04.0s), 03/60 VUs, 46 complete and 0 interrupted iterations
default   [   3% ] 03/60 VUs  0m04.0s/2m00.0s

running (0m05.0s), 04/60 VUs, 67 complete and 0 interrupted iterations
default   [   4% ] 04/60 VUs  0m05.0s/2m00.0s

running (0m06.0s), 04/60 VUs, 93 complete and 0 interrupted iterations
default   [   5% ] 04/60 VUs  0m06.0s/2m00.0s

running (0m07.0s), 05/60 VUs, 123 complete and 0 interrupted iterations
default   [   6% ] 05/60 VUs  0m07.0s/2m00.0s

running (0m08.0s), 06/60 VUs, 156 complete and 0 interrupted iterations
default   [   7% ] 06/60 VUs  0m08.0s/2m00.0s

running (0m09.0s), 06/60 VUs, 195 complete and 0 interrupted iterations
default   [   7% ] 06/60 VUs  0m09.0s/2m00.0s

running (0m10.0s), 07/60 VUs, 237 complete and 0 interrupted iterations
default   [   8% ] 07/60 VUs  0m10.0s/2m00.0s

running (0m11.0s), 07/60 VUs, 282 complete and 0 interrupted iterations
default   [   9% ] 07/60 VUs  0m11.0s/2m00.0s

running (0m12.0s), 08/60 VUs, 335 complete and 0 interrupted iterations
default   [  10% ] 08/60 VUs  0m12.0s/2m00.0s

running (0m13.0s), 09/60 VUs, 387 complete and 0 interrupted iterations
default   [  11% ] 09/60 VUs  0m13.0s/2m00.0s

running (0m14.0s), 09/60 VUs, 447 complete and 0 interrupted iterations
default   [  12% ] 09/60 VUs  0m14.0s/2m00.0s

running (0m15.0s), 10/60 VUs, 510 complete and 0 interrupted iterations
default   [  12% ] 10/60 VUs  0m15.0s/2m00.0s

running (0m16.0s), 11/60 VUs, 576 complete and 0 interrupted iterations
default   [  13% ] 11/60 VUs  0m16.0s/2m00.0s

running (0m17.0s), 11/60 VUs, 648 complete and 0 interrupted iterations
default   [  14% ] 11/60 VUs  0m17.0s/2m00.0s

running (0m18.0s), 12/60 VUs, 722 complete and 0 interrupted iterations
default   [  15% ] 12/60 VUs  0m18.0s/2m00.0s

running (0m19.0s), 13/60 VUs, 801 complete and 0 interrupted iterations
default   [  16% ] 13/60 VUs  0m19.0s/2m00.0s

running (0m20.0s), 13/60 VUs, 880 complete and 0 interrupted iterations
default   [  17% ] 13/60 VUs  0m20.0s/2m00.0s

running (0m21.0s), 14/60 VUs, 961 complete and 0 interrupted iterations
default   [  17% ] 14/60 VUs  0m21.0s/2m00.0s

running (0m22.0s), 14/60 VUs, 1057 complete and 0 interrupted iterations
default   [  18% ] 14/60 VUs  0m22.0s/2m00.0s

running (0m23.0s), 15/60 VUs, 1133 complete and 0 interrupted iterations
default   [  19% ] 15/60 VUs  0m23.0s/2m00.0s

running (0m24.0s), 16/60 VUs, 1222 complete and 0 interrupted iterations
default   [  20% ] 16/60 VUs  0m24.0s/2m00.0s

running (0m25.0s), 16/60 VUs, 1305 complete and 0 interrupted iterations
default   [  21% ] 16/60 VUs  0m25.0s/2m00.0s

running (0m26.0s), 17/60 VUs, 1388 complete and 0 interrupted iterations
default   [  22% ] 17/60 VUs  0m26.0s/2m00.0s

running (0m27.0s), 18/60 VUs, 1474 complete and 0 interrupted iterations
default   [  22% ] 18/60 VUs  0m27.0s/2m00.0s

running (0m28.0s), 18/60 VUs, 1581 complete and 0 interrupted iterations
default   [  23% ] 18/60 VUs  0m28.0s/2m00.0s

running (0m29.0s), 19/60 VUs, 1692 complete and 0 interrupted iterations
default   [  24% ] 19/60 VUs  0m29.0s/2m00.0s

running (0m30.0s), 19/60 VUs, 1808 complete and 0 interrupted iterations
default   [  25% ] 19/60 VUs  0m30.0s/2m00.0s

running (0m31.0s), 20/60 VUs, 1910 complete and 0 interrupted iterations
default   [  26% ] 20/60 VUs  0m31.0s/2m00.0s

running (0m32.0s), 21/60 VUs, 1997 complete and 0 interrupted iterations
default   [  27% ] 21/60 VUs  0m32.0s/2m00.0s

running (0m33.0s), 21/60 VUs, 2102 complete and 0 interrupted iterations
default   [  27% ] 21/60 VUs  0m33.0s/2m00.0s

running (0m34.0s), 22/60 VUs, 2212 complete and 0 interrupted iterations
default   [  28% ] 22/60 VUs  0m34.0s/2m00.0s

running (0m35.0s), 23/60 VUs, 2315 complete and 0 interrupted iterations
default   [  29% ] 23/60 VUs  0m35.0s/2m00.0s

running (0m36.0s), 23/60 VUs, 2416 complete and 0 interrupted iterations
default   [  30% ] 23/60 VUs  0m36.0s/2m00.0s

running (0m37.0s), 24/60 VUs, 2550 complete and 0 interrupted iterations
default   [  31% ] 24/60 VUs  0m37.0s/2m00.0s

running (0m38.0s), 25/60 VUs, 2686 complete and 0 interrupted iterations
default   [  32% ] 25/60 VUs  0m38.0s/2m00.0s

running (0m39.0s), 25/60 VUs, 2811 complete and 0 interrupted iterations
default   [  32% ] 25/60 VUs  0m39.0s/2m00.0s

running (0m40.0s), 26/60 VUs, 2937 complete and 0 interrupted iterations
default   [  33% ] 26/60 VUs  0m40.0s/2m00.0s

running (0m41.0s), 27/60 VUs, 3083 complete and 0 interrupted iterations
default   [  34% ] 27/60 VUs  0m41.0s/2m00.0s

running (0m42.0s), 27/60 VUs, 3216 complete and 0 interrupted iterations
default   [  35% ] 27/60 VUs  0m42.0s/2m00.0s

running (0m43.0s), 28/60 VUs, 3370 complete and 0 interrupted iterations
default   [  36% ] 28/60 VUs  0m43.0s/2m00.0s

running (0m44.0s), 29/60 VUs, 3482 complete and 0 interrupted iterations
default   [  37% ] 29/60 VUs  0m44.0s/2m00.0s

running (0m45.0s), 29/60 VUs, 3620 complete and 0 interrupted iterations
default   [  37% ] 29/60 VUs  0m45.0s/2m00.0s

running (0m46.0s), 30/60 VUs, 3788 complete and 0 interrupted iterations
default   [  38% ] 30/60 VUs  0m46.0s/2m00.0s

running (0m47.0s), 31/60 VUs, 3906 complete and 0 interrupted iterations
default   [  39% ] 31/60 VUs  0m47.0s/2m00.0s

running (0m48.0s), 31/60 VUs, 4092 complete and 0 interrupted iterations
default   [  40% ] 31/60 VUs  0m48.0s/2m00.0s

running (0m49.0s), 32/60 VUs, 4241 complete and 0 interrupted iterations
default   [  41% ] 32/60 VUs  0m49.0s/2m00.0s

running (0m50.0s), 33/60 VUs, 4446 complete and 0 interrupted iterations
default   [  42% ] 33/60 VUs  0m50.0s/2m00.0s

running (0m51.0s), 33/60 VUs, 4635 complete and 0 interrupted iterations
default   [  42% ] 33/60 VUs  0m51.0s/2m00.0s

running (0m52.0s), 34/60 VUs, 4756 complete and 0 interrupted iterations
default   [  43% ] 34/60 VUs  0m52.0s/2m00.0s

running (0m53.0s), 35/60 VUs, 4941 complete and 0 interrupted iterations
default   [  44% ] 35/60 VUs  0m53.0s/2m00.0s

running (0m54.0s), 35/60 VUs, 5151 complete and 0 interrupted iterations
default   [  45% ] 35/60 VUs  0m54.0s/2m00.0s

running (0m55.0s), 36/60 VUs, 5311 complete and 0 interrupted iterations
default   [  46% ] 36/60 VUs  0m55.0s/2m00.0s

running (0m56.0s), 37/60 VUs, 5529 complete and 0 interrupted iterations
default   [  47% ] 37/60 VUs  0m56.0s/2m00.0s

running (0m57.0s), 37/60 VUs, 5751 complete and 0 interrupted iterations
default   [  47% ] 37/60 VUs  0m57.0s/2m00.0s

running (0m58.0s), 38/60 VUs, 5932 complete and 0 interrupted iterations
default   [  48% ] 38/60 VUs  0m58.0s/2m00.0s

running (0m59.0s), 39/60 VUs, 6140 complete and 0 interrupted iterations
default   [  49% ] 39/60 VUs  0m59.0s/2m00.0s

running (1m00.0s), 39/60 VUs, 6314 complete and 0 interrupted iterations
default   [  50% ] 39/60 VUs  1m00.0s/2m00.0s

running (1m01.0s), 40/60 VUs, 6500 complete and 0 interrupted iterations
default   [  51% ] 40/60 VUs  1m01.0s/2m00.0s

running (1m02.0s), 41/60 VUs, 6631 complete and 0 interrupted iterations
default   [  52% ] 41/60 VUs  1m02.0s/2m00.0s

running (1m03.0s), 41/60 VUs, 6824 complete and 0 interrupted iterations
default   [  52% ] 41/60 VUs  1m03.0s/2m00.0s

running (1m04.0s), 42/60 VUs, 7070 complete and 0 interrupted iterations
default   [  53% ] 42/60 VUs  1m04.0s/2m00.0s

running (1m05.0s), 43/60 VUs, 7225 complete and 0 interrupted iterations
default   [  54% ] 43/60 VUs  1m05.0s/2m00.0s

running (1m06.0s), 43/60 VUs, 7402 complete and 0 interrupted iterations
default   [  55% ] 43/60 VUs  1m06.0s/2m00.0s

running (1m07.0s), 44/60 VUs, 7568 complete and 0 interrupted iterations
default   [  56% ] 44/60 VUs  1m07.0s/2m00.0s

running (1m08.0s), 45/60 VUs, 7754 complete and 0 interrupted iterations
default   [  57% ] 45/60 VUs  1m08.0s/2m00.0s

running (1m09.0s), 45/60 VUs, 8002 complete and 0 interrupted iterations
default   [  57% ] 45/60 VUs  1m09.0s/2m00.0s

running (1m10.0s), 46/60 VUs, 8163 complete and 0 interrupted iterations
default   [  58% ] 46/60 VUs  1m10.0s/2m00.0s

running (1m11.0s), 47/60 VUs, 8306 complete and 0 interrupted iterations
default   [  59% ] 47/60 VUs  1m11.0s/2m00.0s

running (1m12.0s), 47/60 VUs, 8414 complete and 0 interrupted iterations
default   [  60% ] 47/60 VUs  1m12.0s/2m00.0s

running (1m13.0s), 48/60 VUs, 8570 complete and 0 interrupted iterations
default   [  61% ] 48/60 VUs  1m13.0s/2m00.0s

running (1m14.0s), 49/60 VUs, 8761 complete and 0 interrupted iterations
default   [  62% ] 49/60 VUs  1m14.0s/2m00.0s

running (1m15.0s), 49/60 VUs, 8908 complete and 0 interrupted iterations
default   [  62% ] 49/60 VUs  1m15.0s/2m00.0s

running (1m16.0s), 50/60 VUs, 9080 complete and 0 interrupted iterations
default   [  63% ] 50/60 VUs  1m16.0s/2m00.0s

running (1m17.0s), 51/60 VUs, 9229 complete and 0 interrupted iterations
default   [  64% ] 51/60 VUs  1m17.0s/2m00.0s

running (1m18.0s), 51/60 VUs, 9463 complete and 0 interrupted iterations
default   [  65% ] 51/60 VUs  1m18.0s/2m00.0s

running (1m19.0s), 52/60 VUs, 9672 complete and 0 interrupted iterations
default   [  66% ] 52/60 VUs  1m19.0s/2m00.0s

running (1m20.0s), 53/60 VUs, 9872 complete and 0 interrupted iterations
default   [  67% ] 53/60 VUs  1m20.0s/2m00.0s

running (1m21.0s), 53/60 VUs, 10038 complete and 0 interrupted iterations
default   [  67% ] 53/60 VUs  1m21.0s/2m00.0s

running (1m22.0s), 54/60 VUs, 10211 complete and 0 interrupted iterations
default   [  68% ] 54/60 VUs  1m22.0s/2m00.0s

running (1m23.0s), 55/60 VUs, 10410 complete and 0 interrupted iterations
default   [  69% ] 55/60 VUs  1m23.0s/2m00.0s

running (1m24.0s), 55/60 VUs, 10554 complete and 0 interrupted iterations
default   [  70% ] 55/60 VUs  1m24.0s/2m00.0s

running (1m25.0s), 56/60 VUs, 10706 complete and 0 interrupted iterations
default   [  71% ] 56/60 VUs  1m25.0s/2m00.0s

running (1m26.0s), 57/60 VUs, 10854 complete and 0 interrupted iterations
default   [  72% ] 57/60 VUs  1m26.0s/2m00.0s

running (1m27.0s), 57/60 VUs, 11026 complete and 0 interrupted iterations
default   [  72% ] 57/60 VUs  1m27.0s/2m00.0s

running (1m28.0s), 58/60 VUs, 11214 complete and 0 interrupted iterations
default   [  73% ] 58/60 VUs  1m28.0s/2m00.0s

running (1m29.0s), 59/60 VUs, 11438 complete and 0 interrupted iterations
default   [  74% ] 59/60 VUs  1m29.0s/2m00.0s

running (1m30.0s), 59/60 VUs, 11677 complete and 0 interrupted iterations
default   [  75% ] 59/60 VUs  1m30.0s/2m00.0s

running (1m31.0s), 59/60 VUs, 11878 complete and 0 interrupted iterations
default   [  76% ] 59/60 VUs  1m31.0s/2m00.0s

running (1m32.0s), 57/60 VUs, 12132 complete and 0 interrupted iterations
default   [  77% ] 57/60 VUs  1m32.0s/2m00.0s

running (1m33.0s), 55/60 VUs, 12433 complete and 0 interrupted iterations
default   [  77% ] 55/60 VUs  1m33.0s/2m00.0s

running (1m34.0s), 53/60 VUs, 12627 complete and 0 interrupted iterations
default   [  78% ] 53/60 VUs  1m34.0s/2m00.0s

running (1m35.0s), 51/60 VUs, 12857 complete and 0 interrupted iterations
default   [  79% ] 51/60 VUs  1m35.0s/2m00.0s

running (1m36.0s), 49/60 VUs, 13118 complete and 0 interrupted iterations
default   [  80% ] 49/60 VUs  1m36.0s/2m00.0s

running (1m37.0s), 47/60 VUs, 13344 complete and 0 interrupted iterations
default   [  81% ] 47/60 VUs  1m37.0s/2m00.0s

running (1m38.0s), 45/60 VUs, 13628 complete and 0 interrupted iterations
default   [  82% ] 45/60 VUs  1m38.0s/2m00.0s

running (1m39.0s), 43/60 VUs, 13890 complete and 0 interrupted iterations
default   [  82% ] 43/60 VUs  1m39.0s/2m00.0s

running (1m40.0s), 41/60 VUs, 14125 complete and 0 interrupted iterations
default   [  83% ] 41/60 VUs  1m40.0s/2m00.0s

running (1m41.0s), 39/60 VUs, 14325 complete and 0 interrupted iterations
default   [  84% ] 39/60 VUs  1m41.0s/2m00.0s

running (1m42.0s), 37/60 VUs, 14506 complete and 0 interrupted iterations
default   [  85% ] 37/60 VUs  1m42.0s/2m00.0s

running (1m43.0s), 35/60 VUs, 14659 complete and 0 interrupted iterations
default   [  86% ] 35/60 VUs  1m43.0s/2m00.0s

running (1m44.0s), 33/60 VUs, 14793 complete and 0 interrupted iterations
default   [  87% ] 33/60 VUs  1m44.0s/2m00.0s

running (1m45.0s), 31/60 VUs, 14910 complete and 0 interrupted iterations
default   [  87% ] 31/60 VUs  1m45.0s/2m00.0s

running (1m46.0s), 29/60 VUs, 15088 complete and 0 interrupted iterations
default   [  88% ] 29/60 VUs  1m46.0s/2m00.0s

running (1m47.0s), 27/60 VUs, 15253 complete and 0 interrupted iterations
default   [  89% ] 27/60 VUs  1m47.0s/2m00.0s

running (1m48.0s), 25/60 VUs, 15396 complete and 0 interrupted iterations
default   [  90% ] 25/60 VUs  1m48.0s/2m00.0s

running (1m49.0s), 23/60 VUs, 15506 complete and 0 interrupted iterations
default   [  91% ] 23/60 VUs  1m49.0s/2m00.0s

running (1m50.0s), 21/60 VUs, 15624 complete and 0 interrupted iterations
default   [  92% ] 21/60 VUs  1m50.0s/2m00.0s

running (1m51.0s), 19/60 VUs, 15719 complete and 0 interrupted iterations
default   [  92% ] 19/60 VUs  1m51.0s/2m00.0s

running (1m52.0s), 17/60 VUs, 15800 complete and 0 interrupted iterations
default   [  93% ] 17/60 VUs  1m52.0s/2m00.0s

running (1m53.0s), 15/60 VUs, 15881 complete and 0 interrupted iterations
default   [  94% ] 15/60 VUs  1m53.0s/2m00.0s

running (1m54.0s), 13/60 VUs, 15950 complete and 0 interrupted iterations
default   [  95% ] 13/60 VUs  1m54.0s/2m00.0s

running (1m55.0s), 11/60 VUs, 16021 complete and 0 interrupted iterations
default   [  96% ] 11/60 VUs  1m55.0s/2m00.0s

running (1m56.0s), 09/60 VUs, 16071 complete and 0 interrupted iterations
default   [  97% ] 09/60 VUs  1m56.0s/2m00.0s

running (1m57.0s), 07/60 VUs, 16119 complete and 0 interrupted iterations
default   [  97% ] 07/60 VUs  1m57.0s/2m00.0s

running (1m58.0s), 05/60 VUs, 16160 complete and 0 interrupted iterations
default   [  98% ] 05/60 VUs  1m58.0s/2m00.0s

running (1m59.0s), 03/60 VUs, 16183 complete and 0 interrupted iterations
default   [  99% ] 03/60 VUs  1m59.0s/2m00.0s

running (2m00.0s), 01/60 VUs, 16195 complete and 0 interrupted iterations
default   [ 100% ] 01/60 VUs  2m00.0s/2m00.0s

     data_received..................: 1.9 MB 16 kB/s
     data_sent......................: 1.7 MB 14 kB/s
     http_req_blocked...............: avg=18.06µs  min=1.28µs   med=6.35µs   max=10.47ms p(90)=13.45µs  p(95)=15.72µs 
     http_req_connecting............: avg=3.07µs   min=0s       med=0s       max=8ms     p(90)=0s       p(95)=0s      
   ✓ http_req_duration..............: avg=119.39ms min=50.11ms  med=94.18ms  max=1.21s   p(90)=217.31ms p(95)=305.04ms
       { expected_response:true }...: avg=119.39ms min=50.11ms  med=94.18ms  max=1.21s   p(90)=217.31ms p(95)=305.04ms
   ✓ http_req_failed................: 0.00%  ✓ 0          ✗ 16196
     http_req_receiving.............: avg=142.81µs min=9.56µs   med=57.1µs   max=19.33ms p(90)=177.43µs p(95)=281.55µs
     http_req_sending...............: avg=87.73µs  min=4.25µs   med=24.29µs  max=19.03ms p(90)=70.8µs   p(95)=190.44µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=119.16ms min=50.08ms  med=93.89ms  max=1.21s   p(90)=216.42ms p(95)=304.37ms
     http_reqs......................: 16196  134.815788/s
     iteration_duration.............: avg=221.64ms min=150.37ms med=196.24ms max=1.31s   p(90)=321.14ms p(95)=408.55ms
     iterations.....................: 16196  134.815788/s
     vus............................: 1      min=1        max=59 
     vus_max........................: 60     min=60       max=60 


running (2m00.1s), 00/60 VUs, 16196 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/60 VUs  2m0s